Repository: Johnn3y/Curlew
Catalog: po/*.po
Languages: ar

source: Top
ar: أعلى

source: Bottom
ar: أسفل

source: Left
ar: يسار

source: Right
ar: يمين

source: hr
ar: سا

source: min
ar: د

source: sec
ar: ثا

source: Favorite list
ar: القائمة المفضّلة

source: Format
ar: الصيــغة

source: Up
ar: أعلى

source: Down
ar: أسفل

source: Remove
ar: اِحذف

source: Curlew
ar: كـروان

source: About Curlew
ar: عنْ كروان

source: Easy to use Multimedia Converter for Linux
ar: محوّل وسائط على لينُكس سهل الاستخدام

source: translator-credits
ar: فيصل شامخ <chamfay@gmail.com>

source: KB
ar: ك.ب

source: MB
ar: م.ب

source: GB
ar: ج.ب

source: Hide
ar: أخفِ

source: Stop Conversion
ar: أوقف التحويل

source: Quit application
ar: غادِر البرنامج

source: Show
ar: أظهِر

source: Conversion Error
ar: خطأ في التحويل

source: _Close
ar: _أغلِق

source: Adding files...
ar: جاري إضافة الملفات...

source: _Cancel
ar: _ألغِ

source: <b>File:</b>
ar: <b>الملف:</b>

source: Are you sure you want to save settings?
ar: هل أنت متأكد من أنك تريد حفظ التغييرات؟

source: You can't restore a custom format to defaults.
ar: لا يمكنك استعادة افتراضيات صيغة مخصصة.

source: Are you sure you want to remove this format?
ar: هل أنت متأكد من أنك تريد حذف هذه الصيغة؟

source: Edition
ar: تحرير

source: <span foreground="red"><i><b>WARNING:</b> Please change these values with care!</i></span>
ar: <span foreground="red"><i><b>تحذير:</b> رجاءً غيّر هذه الإعدادات بحذر!</i></span>

source: Audio:
ar: الصوت:

source: Default
ar: الافتراضي

source: Audio Bitrates
ar: معدّلات بتات الصوت

source: Audio Frequencies
ar: ترددات الصوت

source: Audio Channels
ar: قناة الصوت

source: Audio Codecs
ar: ترميزات الصوت

source: Video:
ar: الفيديو:

source: Video Bitrates
ar: معدّلات بتات الفيديو

source: Video FPS
ar: قيمة FPS

source: Video Sizes
ar: مقاسات الفيديو

source: Video Codecs
ar: ترميزات الفيديو

source: Aspect Ratios
ar: التناسبات

source: Other Options:
ar: وسائط أخرى:

source: Extra Options
ar: خيارات أخرى

source: Save
ar: اِحفظ

source: Restore default
ar: اِستعد الافتراضيات

source: <i><span color="red">No format selected!</span></i>
ar: <i><span color="red">لا صيغة مختارة!</span></i>

source: Edit
ar: حرّر

source: Choose
ar: اِختر

source: <span color="red"><i><b>{}</b> Codec not found!</i></span>
ar: <span color="red"><i>الكوديك <b>{}</b> غير موجود</i></span>

source: You can't add more than 10 elements.
ar: لا يمكنك إضافة أكثر من 10 عناصر.

source: "{}" is already exist in favorite list!
ar: التنسيق "{}" موجود مسبقا في القائمة المفضّلة!

source: No Favorites List.
ar: لا توجد قائمة للمفضّلات بعد.

source: About
ar: عنْ

source: Quit
ar: غادِر

source: Available Codecs
ar: الترميزات المتاحة

source: Add Files
ar: أضِف ملفات

source: Add Folders
ar: أضِف مجلدات

source: Remove Files
ar: اِحذِف ملفات

source: Clear Files List
ar: اِمسح قائمة الملفات

source: File Informations
ar: معلومات عن الملف

source: Advanced Options
ar: خيارات متقدمة

source: Convert
ar: حوّل

source: Start Conversion
ar: اِبدأ التحويل

source: Select Action
ar: اِختر عملية

source: Convert Files
ar: تحويل الملفات

source: Merge Files
ar: دمج الملفات

source: Stop Process
ar: أوقِف العملية

source: <b><span size="xx-large">Welcome to Curlew Multimedia Converter!</span></b>
ar: <b><span size="xx-large">مرحبا بك في برنامج كروان لتحويل الوسائط!</span></b>

source: <i>Click</i>
ar: <i>أنقر</i>

source: <i>to add files, or</i>
ar: <i>لإضافة ملفات، أو</i>

source: <i>to add files from folders,</i>
ar: <i>لإضافة ملفات من مجلدات،</i>

source: <i>or you can drag files and drop them to here.</i>
ar: <i>أو يمكنك سحب ملفات وإفلاتهم هنا.</i>

source: Show Sidebar
ar: أظهر الشريط الجانبي

source: File
ar: الملف

source: Size
ar: الحجم

source: Duration
ar: المدة

source: Estimated size
ar: الحجم المقدّر

source: Elapsed time
ar: الوقت المُستغرَق

source: Remaining time
ar: الوقت المتبقّي

source: Progress
ar: التقدم

source: Choose a format
ar: اِختر تنسيقًا

source: Add to Favorite
ar: أضِف إلى المفضّلة

source: Edit Favorite List
ar: حرّر القائمة المفضّلة

source: Audio
ar: الصوت

source: Audio Bitrate
ar: معدّل بتات الصوت

source: Audio Frequency
ar: تردد الصوت

source: Audio Codec
ar: ترميز الصوت

source: Volume (%)
ar: حجم الصوت (%)

source: Audio Quality
ar: جودة الصوت

source: Video
ar: الفيديو

source: Video Bitrate
ar: معدّل بتات الفيديو

source: Video Size
ar: مقاس الفيديو

source: Video Codec
ar: ترميز الفيديو

source: Aspect Ratio
ar: التناسب

source: 2-Pass
ar: تحويلٌ مضاعف

source: Video only
ar: فيديو فقط

source: Video Quality
ar: جودة الفيديو

source: Subtitle
ar: الترجمة

source: Use Subtitle (ffmpeg only)
ar: اِستعمل ملف الترجمة (ffmpeg فقط)

source: Subtitle:
ar: ملف الترجمة:

source: Size:
ar: الحجم:

source: Encoding:
ar: ترميز الخط:

source: Filters
ar: المرشحات

source: Duration (sec)
ar: المدة (ثا)

source: At the beginning
ar: في البداية

source: At the end
ar: في النهاية

source: Both
ar: كلاهما

source: Position
ar: الموضع

source: Type
ar: النوع

source: Crop / Pad
ar: قص / حشو

source: Crop
ar: قص

source: Pad
ar: أضِف حاشية

source: More
ar: المزيد

source: Split File
ar: أنشِئ مقطعًا

source: Begin time:
ar: البداية:

source: Duration:
ar: المدة:

source: To the end
ar: حتى النهاية

source: Use Copy Mode
ar: استعمل النمط Copy

source: Keep the same codecs as the input file
ar: المحافظة على خصائص الملف المصدر

source: Other opts:
ar: وسائط أخرى:

source: Threads:
ar: الخيوط:

source: Converter:
ar: المحوّل:

source: Player:
ar: المشغّل:

source: Please select a player
ar: الرجاء اختيار مشغل

source: Configs
ar: الإعدادات

source: Your language will appear after restart Curlew
ar: لغتك ستظهر عند إعادة تشغيل كروان

source: Language:
ar: اللغة:

source: Show tray icon
ar: أظهِر الأيقونة في مساحة التبليغ

source: Show Statusbar
ar: أظهر شريط الحالة

source: Shutdown computer after finish
ar: أغلِق الجهاز بعد انتهاء التحويل

source: Suspend computer after finish
ar: أسبِت الجهاز بعد انتهاء التحويل

source: Play sound after finish
ar: شغّل صوتًا بعد انتهاء التحويل

source: Output
ar: المخرج

source: Source Path
ar: مسار المصدر

source: Destination:
ar: الوِجهــــة:

source: This name is for merged file
ar: هذا الاسم مخصص للملف المدمج

source: Output Filename:
ar: ملف الوِجهة:

source: Overwrite it
ar: اِستبدله

source: Choose another name
ar: اِختر اسما آخر

source: Skip conversion
ar: تخطّ التحويل

source: File exist:
ar: الملف موجود:

source: Delete input file after conversion
ar: اِحذف الملف المصدر بعد تحويله

source: Rename input file after conversion
ar: غيّر اسم الملف المصدر بعد تحويله

source: Do you want to quit Curlew and abort process?
ar: هل تريد الخروج من برنامج كروان وإلغاء العملية؟

source: Add file
ar: أضِف ملفًا

source: _OK
ar: _موافق

source: All supported files
ar: جميع الملفات المدعومة

source: Video files
ar: ملفاتُ فيديو

source: Audio files
ar: ملفاتٌ صوتية

source: All files
ar: جميع الملفات

source: Ready!
ar: جاهز!

source: Add folder
ar: أضِف مجلدًا

source: Choose destination
ar: اِختر الوِجهة

source: Destination path is not valid.
ar: مسارُ الوِجهة غير صالح.

source: Destination path is not accessible.
ar: مسارُ الوِجهة لا يمكن الوصول إليه.

source: "{}" audio codec not found.
ar: كوديك الصوت "{}" غير موجود.

source: "{}" video codec not found.
ar: كوديك الفيديو "{}" غير موجود.

source: Skipped!
ar: تمّ تخطيه!

source: Not found!
ar: غيرُ موجود!

source: Encoder not found (ffmpeg/avconv).
ar: المحوّل غير موجود (ffmpeg/avconv).

source: Do you want to stop conversion process?
ar: هل تريد إيقاف عملية التحويل؟

source: Select subtitle
ar: اِختر ملف الترجمة

source: _Add
ar: _أضِف

source: Subtitle files
ar: ملفاتُ ترجمة

source: Wait...
ar: انتظار...

source: Done!
ar: تمّ التحويل!

source: Failed!
ar: فشل!

source: <span foreground="red" weight="bold">System will shutdown after {} sec.</span>
ar: <span foreground="red" weight="bold">سيتم إيقاف الجهاز بعد {} ثا.</span>

source: <span foreground="red" weight="bold">System will suspend after {} sec.</span>
ar: <span foreground="red" weight="bold">سيتم إسبات الجهاز بعد {} ثا.</span>

source: <b>Duration:</b> {} <b>Size:</b> {} <b>Extension:</b> {}
ar: <b>المدّة:</b> {} <b>الحجم:</b> {} <b>اللاحقة:</b> {}

source: Please install "mediainfo" package.
ar: الرجاء تنصيب الحزمة "mediainfo".

source: Play
ar: شغّل

source: _Preview
ar: عاين

source: Browse source
ar: استعرِض المصدر

source: Browse destination
ar: اِستعرض الوِجهة

source: Choose Encoder
ar: اِختر محوّلا

source: Merge
ar: اِدمج

source: Start Merging
ar: اِبدأ الدمج

source: <i>Merging files, please wait...</i>
ar: <i>عملية الدمج جارية، الرجاء الانتظار...</i>

source: <i>Percent: 0 %</i>
ar: <i>النسبة: 0 %</i>

source: <i>Percent: {:.0f} %</i>
ar: <i>النسبة: {:.0f} %</i>

source: Merging operation completed successfully!
ar: تمّت عملية الدمج بنجاح!

source: Merge Error
ar: خطأ في الدمج
